{
  "title": "Bhagavad Gita",
  "titleSanskrit": "श्रीमद्भगवद्गीता",
  "totalChapters": 18,
  "totalVerses": 700,
  "source": "IIT Kanpur Gita Supersite, Gita Press Gorakhpur, vedicscriptures/bhagavad-gita-data",
  "description": "The Bhagavad Gita is a 700-verse Hindu scripture that is part of the epic Mahabharata. It contains a conversation between Prince Arjuna and his guide and charioteer Lord Krishna on a variety of philosophical issues.",
  "chapters": [
    {
      "number": 1,
      "name": "Arjuna Vishada Yoga",
      "nameSanskrit": "अर्जुनविषादयोग",
      "meaning": "The Yoga of Arjuna's Dejection",
      "verseCount": 47,
      "summary": "Arjuna, seeing his relatives and teachers arrayed against him on the battlefield, is overcome with grief and moral confusion. He expresses his reluctance to fight and the consequences he foresees."
    },
    {
      "number": 2,
      "name": "Sankhya Yoga",
      "nameSanskrit": "साङ्ख्ययोग",
      "meaning": "The Yoga of Knowledge",
      "verseCount": 72,
      "summary": "Krishna begins his teachings, explaining the eternal nature of the soul, the importance of performing one's duty, and introducing the concepts of Karma Yoga. This chapter contains the essence of the Gita's philosophy."
    },
    {
      "number": 3,
      "name": "Karma Yoga",
      "nameSanskrit": "कर्मयोग",
      "meaning": "The Yoga of Action",
      "verseCount": 43,
      "summary": "Krishna elaborates on the importance of performing one's prescribed duties without attachment to results. He explains how action is superior to inaction and how to act without incurring karma."
    },
    {
      "number": 4,
      "name": "Jnana Karma Sannyasa Yoga",
      "nameSanskrit": "ज्ञानकर्मसंन्यासयोग",
      "meaning": "The Yoga of Knowledge and Renunciation of Action",
      "verseCount": 42,
      "summary": "Krishna reveals the ancient nature of this yoga, explains divine incarnation, and shows how knowledge transforms action. He describes various types of sacrifice and the supremacy of knowledge."
    },
    {
      "number": 5,
      "name": "Karma Sannyasa Yoga",
      "nameSanskrit": "कर्मसंन्यासयोग",
      "meaning": "The Yoga of Renunciation",
      "verseCount": 29,
      "summary": "Krishna compares the path of renunciation with the path of selfless action, showing that both lead to the same goal. He describes the characteristics of one who has achieved inner peace."
    },
    {
      "number": 6,
      "name": "Dhyana Yoga",
      "nameSanskrit": "ध्यानयोग",
      "meaning": "The Yoga of Meditation",
      "verseCount": 47,
      "summary": "Krishna describes the practice of meditation, the control of the mind, and the characteristics of a true yogi. He addresses Arjuna's concern about what happens to those who fail in yoga."
    },
    {
      "number": 7,
      "name": "Jnana Vijnana Yoga",
      "nameSanskrit": "ज्ञानविज्ञानयोग",
      "meaning": "The Yoga of Knowledge and Wisdom",
      "verseCount": 30,
      "summary": "Krishna reveals his divine nature and the two aspects of his being: the manifest and unmanifest. He explains why few seek and attain true knowledge of the divine."
    },
    {
      "number": 8,
      "name": "Aksara Brahma Yoga",
      "nameSanskrit": "अक्षरब्रह्मयोग",
      "meaning": "The Yoga of the Imperishable Brahman",
      "verseCount": 28,
      "summary": "Krishna explains the nature of the supreme reality, the process of death and rebirth, and the importance of remembering the divine at the time of death."
    },
    {
      "number": 9,
      "name": "Raja Vidya Raja Guhya Yoga",
      "nameSanskrit": "राजविद्याराजगुह्ययोग",
      "meaning": "The Yoga of Royal Knowledge and Royal Secret",
      "verseCount": 34,
      "summary": "Krishna reveals the supreme secret: the nature of his omnipresence and the path of pure devotion. He shows how he pervades all creation while remaining unattached."
    },
    {
      "number": 10,
      "name": "Vibhuti Yoga",
      "nameSanskrit": "विभूतियोग",
      "meaning": "The Yoga of Divine Manifestations",
      "verseCount": 42,
      "summary": "Krishna describes his divine glories and manifestations in the world. He explains how he is the source of all that is excellent and glorious in creation."
    },
    {
      "number": 11,
      "name": "Vishwarupa Darshana Yoga",
      "nameSanskrit": "विश्वरूपदर्शनयोग",
      "meaning": "The Yoga of the Vision of the Universal Form",
      "verseCount": 55,
      "summary": "At Arjuna's request, Krishna reveals his cosmic form containing all of existence. Arjuna witnesses the entire universe in Krishna's body and is overwhelmed by the terrifying and awe-inspiring vision."
    },
    {
      "number": 12,
      "name": "Bhakti Yoga",
      "nameSanskrit": "भक्तियोग",
      "meaning": "The Yoga of Devotion",
      "verseCount": 20,
      "summary": "Krishna explains the path of devotion and describes the qualities dear to him. He shows that loving devotion is the most direct path to the divine."
    },
    {
      "number": 13,
      "name": "Kshetra Kshetrajna Vibhaga Yoga",
      "nameSanskrit": "क्षेत्रक्षेत्रज्ञविभागयोग",
      "meaning": "The Yoga of the Field and the Knower",
      "verseCount": 35,
      "summary": "Krishna explains the difference between the body (field) and the soul (knower of the field). He describes the nature of knowledge, the knowable, and the relationship between Prakriti and Purusha."
    },
    {
      "number": 14,
      "name": "Gunatraya Vibhaga Yoga",
      "nameSanskrit": "गुणत्रयविभागयोग",
      "meaning": "The Yoga of the Three Gunas",
      "verseCount": 27,
      "summary": "Krishna explains the three modes of material nature (gunas): sattva, rajas, and tamas. He describes how they bind the soul and how to transcend them."
    },
    {
      "number": 15,
      "name": "Purushottama Yoga",
      "nameSanskrit": "पुरुषोत्तमयोग",
      "meaning": "The Yoga of the Supreme Person",
      "verseCount": 20,
      "summary": "Using the metaphor of the sacred fig tree, Krishna explains the nature of the material world and reveals himself as the Supreme Person beyond both the perishable and imperishable."
    },
    {
      "number": 16,
      "name": "Daivasura Sampad Vibhaga Yoga",
      "nameSanskrit": "दैवासुरसम्पद्विभागयोग",
      "meaning": "The Yoga of Divine and Demonic Natures",
      "verseCount": 24,
      "summary": "Krishna describes the divine and demonic qualities in human beings. He warns against desire, anger, and greed as the three gates to hell."
    },
    {
      "number": 17,
      "name": "Sraddhatraya Vibhaga Yoga",
      "nameSanskrit": "श्रद्धात्रयविभागयोग",
      "meaning": "The Yoga of the Three Kinds of Faith",
      "verseCount": 28,
      "summary": "Krishna explains how the three gunas influence faith, food, sacrifice, austerity, and charity. He introduces the sacred syllables Om Tat Sat."
    },
    {
      "number": 18,
      "name": "Moksha Sannyasa Yoga",
      "nameSanskrit": "मोक्षसंन्यासयोग",
      "meaning": "The Yoga of Liberation through Renunciation",
      "verseCount": 78,
      "summary": "The concluding chapter summarizes the teachings and reveals the highest secret. Krishna urges Arjuna to abandon all dharmas and surrender to him alone, promising liberation from all sins."
    }
  ],
  "verses": [
    {
      "chapter": 1,
      "verse": 1,
      "sanskrit": "धर्मक्षेत्रे कुरुक्षेत्रे समवेता युयुत्सवः। मामकाः पाण्डवाश्चैव किमकुर्वत सञ्जय॥",
      "transliteration": "dharma-kṣetre kuru-kṣetre samavetā yuyutsavaḥ māmakāḥ pāṇḍavāś caiva kim akurvata sañjaya",
      "wordByWord": "dharma-kṣetre—in the place of pilgrimage; kuru-kṣetre—in the place named Kurukṣetra; samavetāḥ—assembled; yuyutsavaḥ—desiring to fight; māmakāḥ—my party (sons); pāṇḍavāḥ—the sons of Pāṇḍu; ca—and; eva—certainly; kim—what; akurvata—did they do; sañjaya—O Sañjaya",
      "translations": {
        "english": "Dhritarashtra said: O Sanjaya, after my sons and the sons of Pandu assembled in the place of pilgrimage at Kurukshetra, desiring to fight, what did they do?",
        "hindi": "धृतराष्ट्र बोले — हे संजय! धर्मभूमि कुरुक्षेत्र में एकत्र हुए, युद्ध की इच्छा वाले, मेरे और पाण्डु के पुत्रों ने क्या किया?",
        "telugu": "ధృతరాష్ట్రుడు పలికెను - ఓ సంజయా! ధర్మక్షేత్రమైన కురుక్షేత్రమున యుద్ధము చేయవలెనని సమావేశమైన నా కుమారులును పాండవులును ఏమి చేసిరి?",
        "tamil": "திருதராஷ்டிரன் கூறினான்: சஞ்சயனே! தர்மபூமியான குருக்ஷேத்திரத்தில் போர் செய்ய ஒன்று கூடிய என் மக்களும் பாண்டவர்களும் என்ன செய்தார்கள்?",
        "kannada": "ಧೃತರಾಷ್ಟ್ರನು ಹೇಳಿದನು - ಸಂಜಯ! ಧರ್ಮಕ್ಷೇತ್ರವಾದ ಕುರುಕ್ಷೇತ್ರದಲ್ಲಿ ಯುದ್ಧ ಮಾಡಲು ಸೇರಿದ ನನ್ನ ಮಕ್ಕಳು ಮತ್ತು ಪಾಂಡವರು ಏನು ಮಾಡಿದರು?"
      },
      "explanation": "This opening verse sets the scene for the entire Bhagavad Gita. King Dhritarashtra, being blind, asks his minister Sanjaya about the events at Kurukshetra. The term 'dharma-kshetra' (field of dharma) is significant as it foreshadows the spiritual teachings that will unfold on this battlefield."
    },
    {
      "chapter": 2,
      "verse": 47,
      "sanskrit": "कर्मण्येवाधिकारस्ते मा फलेषु कदाचन। मा कर्मफलहेतुर्भूर्मा ते सङ्गोऽस्त्वकर्मणि॥",
      "transliteration": "karmaṇy evādhikāras te mā phaleṣu kadācana mā karma-phala-hetur bhūr mā te saṅgo 'stv akarmaṇi",
      "wordByWord": "karmaṇi—in action; eva—only; adhikāraḥ—right; te—your; mā—not; phaleṣu—in the fruits; kadācana—at any time; mā—not; karma-phala—result of action; hetuḥ—cause; bhūḥ—become; mā—not; te—your; saṅgaḥ—attachment; astu—let there be; akarmaṇi—in inaction",
      "translations": {
        "english": "You have a right to perform your prescribed duties, but you are not entitled to the fruits of your actions. Never consider yourself to be the cause of the results of your activities, nor be attached to inaction.",
        "hindi": "कर्म करने में ही तेरा अधिकार है, फल में कभी नहीं। कर्मफल का हेतु मत बन और अकर्म में भी तेरी आसक्ति न हो।",
        "telugu": "నీకు కర్మ చేయుటయందే అధికారము కలదు. కర్మఫలమునందు ఎప్పుడును లేదు. కర్మఫలమునకు హేతువు కావలదు. అకర్మయందు ఆసక్తి కూడదు.",
        "tamil": "செயலில் மட்டுமே உனக்கு உரிமை உண்டு, பலனில் ஒருபோதும் இல்லை. செயலின் பலனுக்குக் காரணமாக இருக்காதே, செயலின்மையிலும் பற்று கொள்ளாதே.",
        "kannada": "ಕರ್ಮದಲ್ಲಿ ಮಾತ್ರ ನಿನಗೆ ಅಧಿಕಾರವಿದೆ, ಫಲದಲ್ಲಿ ಎಂದಿಗೂ ಇಲ್ಲ. ಕರ್ಮಫಲಕ್ಕೆ ಕಾರಣನಾಗಬೇಡ, ಅಕರ್ಮದಲ್ಲಿ ನಿನಗೆ ಆಸಕ್ತಿ ಇರಬಾರದು."
      },
      "explanation": "This is one of the most important verses in the Gita, establishing the principle of Nishkama Karma (selfless action). Krishna teaches that we should focus on our duties with full dedication, but without attachment to outcomes."
    },
    {
      "chapter": 2,
      "verse": 48,
      "sanskrit": "योगस्थः कुरु कर्माणि सङ्गं त्यक्त्वा धनञ्जय। सिद्ध्यसिद्ध्योः समो भूत्वा समत्वं योग उच्यते॥",
      "transliteration": "yoga-sthaḥ kuru karmāṇi saṅgaṁ tyaktvā dhanañjaya siddhy-asiddhyoḥ samo bhūtvā samatvaṁ yoga ucyate",
      "wordByWord": "yoga-sthaḥ—steadfast in yoga; kuru—perform; karmāṇi—duties; saṅgam—attachment; tyaktvā—having abandoned; dhanañjaya—O Arjuna; siddhi-asiddhyoḥ—in success and failure; samaḥ—equipoised; bhūtvā—having become; samatvam—equanimity; yogaḥ—yoga; ucyate—is called",
      "translations": {
        "english": "Perform your duties established in yoga, O Arjuna, abandoning attachment, and be balanced in success and failure. This evenness of mind is called yoga.",
        "hindi": "हे धनञ्जय! योग में स्थित होकर कर्म कर, आसक्ति को त्यागकर, सिद्धि-असिद्धि में समान भाव रखते हुए। यह समता ही योग कहलाता है।",
        "telugu": "ఓ ధనంజయా! ఆసక్తిని విడిచి, సిద్ధి అసిద్ధులయందు సమత్వమును పొంది, యోగమునందు స్థితుడవై కర్మలను చేయుము. సమత్వమే యోగమని చెప్పబడును.",
        "tamil": "பற்றை விட்டு, வெற்றி தோல்வியில் சமமாக இருந்து, யோகத்தில் நிலைத்து கர்மங்களைச் செய். இந்த சமநிலையே யோகம் எனப்படும்.",
        "kannada": "ಓ ಧನಂಜಯ! ಆಸಕ್ತಿಯನ್ನು ತ್ಯಜಿಸಿ, ಯೋಗದಲ್ಲಿ ಸ್ಥಿತನಾಗಿ ಕರ್ಮಗಳನ್ನು ಮಾಡು. ಸಿದ್ಧಿ-ಅಸಿದ್ಧಿಗಳಲ್ಲಿ ಸಮನಾಗು. ಈ ಸಮತ್ವವೇ ಯೋಗ ಎನ್ನಲಾಗುತ್ತದೆ."
      },
      "explanation": "Krishna defines yoga as equanimity—maintaining balance of mind regardless of success or failure. True yoga is not just physical postures, but a mental state of steadiness and detachment while performing one's duties."
    },
    {
      "chapter": 3,
      "verse": 19,
      "sanskrit": "तस्मादसक्तः सततं कार्यं कर्म समाचर। असक्तो ह्याचरन्कर्म परमाप्नोति पूरुषः॥",
      "transliteration": "tasmād asaktaḥ satataṁ kāryaṁ karma samācara asakto hy ācaran karma param āpnoti pūruṣaḥ",
      "wordByWord": "tasmāt—therefore; asaktaḥ—without attachment; satatam—constantly; kāryam—as duty; karma—work; samācara—perform; asaktaḥ—without attachment; hi—certainly; ācaran—performing; karma—work; param—the Supreme; āpnoti—achieves; pūruṣaḥ—a person",
      "translations": {
        "english": "Therefore, without attachment, always perform the work that has to be done; for by performing action without attachment, one attains the Supreme.",
        "hindi": "इसलिए तू निरंतर आसक्ति रहित होकर कर्तव्य कर्म का अच्छी तरह आचरण कर; क्योंकि आसक्ति रहित होकर कर्म करता हुआ मनुष्य परम पुरुष को प्राप्त होता है।",
        "telugu": "అందువల్ల ఆసక్తి లేకుండా ఎల్లప్పుడు చేయవలసిన కర్మను చేయుము. ఆసక్తి లేకుండా కర్మ చేయు పురుషుడు పరమాత్మను పొందును.",
        "tamil": "ஆகவே, பற்றின்றி எப்போதும் செய்ய வேண்டிய கர்மத்தைச் செய். பற்றின்றி கர்மம் செய்வதால் மனிதன் பரமபதத்தை அடைகிறான்.",
        "kannada": "ಆದ್ದರಿಂದ ಆಸಕ್ತಿಯಿಲ್ಲದೆ ಯಾವಾಗಲೂ ಮಾಡಬೇಕಾದ ಕರ್ಮವನ್ನು ಮಾಡು. ಆಸಕ್ತಿಯಿಲ್ಲದೆ ಕರ್ಮವನ್ನು ಮಾಡುವ ಮನುಷ್ಯ ಪರಮಾತ್ಮನನ್ನು ಪಡೆಯುತ್ತಾನೆ."
      },
      "explanation": "This verse reinforces the central teaching of Karma Yoga. Detachment doesn't mean indifference or lack of effort, but freedom from obsessive concern about results."
    },
    {
      "chapter": 4,
      "verse": 7,
      "sanskrit": "यदा यदा हि धर्मस्य ग्लानिर्भवति भारत। अभ्युत्थानमधर्मस्य तदात्मानं सृजाम्यहम्॥",
      "transliteration": "yadā yadā hi dharmasya glānir bhavati bhārata abhyutthānam adharmasya tadātmānaṁ sṛjāmy aham",
      "wordByWord": "yadā yadā—whenever; hi—certainly; dharmasya—of religion; glāniḥ—discrepancies; bhavati—become manifested; bhārata—O descendant of Bharata; abhyutthānam—predominance; adharmasya—of irreligion; tadā—at that time; ātmānam—self; sṛjāmi—manifest; aham—I",
      "translations": {
        "english": "Whenever there is a decline of dharma, O Arjuna, and a rise of adharma, at that time I manifest Myself.",
        "hindi": "हे भारत! जब-जब धर्म की हानि और अधर्म की वृद्धि होती है, तब-तब मैं अपने आप को प्रकट करता हूँ।",
        "telugu": "ఓ భారతా! ఎప్పుడెప్పుడు ధర్మము క్షీణించి అధర్మము అభివృద్ధి చెందునో అప్పుడప్పుడు నేను నన్ను సృష్టించుకొందును.",
        "tamil": "பாரதா! எப்போதெல்லாம் தர்மம் தளர்ச்சியடைகிறதோ, அதர்மம் எழுச்சி பெறுகிறதோ, அப்போதெல்லாம் நான் என்னைத் தோற்றுவிக்கிறேன்.",
        "kannada": "ಭಾರತ! ಯಾವಾಗ ಧರ್ಮದ ಹಾನಿಯೂ ಅಧರ್ಮದ ಅಭ್ಯುದಯವೂ ಆಗುತ್ತದೆಯೋ ಆಗ ನಾನು ನನ್ನನ್ನು ಸೃಷ್ಟಿಸಿಕೊಳ್ಳುತ್ತೇನೆ."
      },
      "explanation": "This famous verse speaks of divine intervention. When righteousness declines and unrighteousness rises, the Divine manifests to restore balance. This is the philosophical basis for the concept of avatars in Hindu tradition."
    },
    {
      "chapter": 4,
      "verse": 8,
      "sanskrit": "परित्राणाय साधूनां विनाशाय च दुष्कृताम्। धर्मसंस्थापनार्थाय सम्भवामि युगे युगे॥",
      "transliteration": "paritrāṇāya sādhūnāṁ vināśāya ca duṣkṛtām dharma-saṁsthāpanārthāya sambhavāmi yuge yuge",
      "wordByWord": "paritrāṇāya—for the deliverance; sādhūnām—of the devotees; vināśāya—for the annihilation; ca—and; duṣkṛtām—of the miscreants; dharma—principles of religion; saṁsthāpana-arthāya—to reestablish; sambhavāmi—I do appear; yuge—millennium; yuge—after millennium",
      "translations": {
        "english": "To protect the righteous, to annihilate the wicked, and to reestablish the principles of dharma, I appear millennium after millennium.",
        "hindi": "साधुओं की रक्षा करने के लिए, दुष्कृत्यों का विनाश करने के लिए और धर्म की पुनर्स्थापना के लिए मैं युग-युग में प्रकट होता हूँ।",
        "telugu": "సాధువులను రక్షించుటకు, దుష్టులను నశింపజేయుటకు, ధర్మమును స్థాపించుటకు యుగయుగమునందు నేను అవతరించుచుందును.",
        "tamil": "நல்லோரைக் காப்பாற்றவும், தீயோரை அழிக்கவும், தர்மத்தை நிலைநாட்டவும் ஒவ்வொரு யுகத்திலும் நான் அவதரிக்கிறேன்.",
        "kannada": "ಸಾಧುಗಳನ್ನು ರಕ್ಷಿಸಲು, ದುಷ್ಟರನ್ನು ನಾಶಮಾಡಲು, ಧರ್ಮವನ್ನು ಸ್ಥಾಪಿಸಲು ನಾನು ಯುಗ ಯುಗದಲ್ಲಿ ಜನ್ಮತಾಳುತ್ತೇನೆ."
      },
      "explanation": "Continuing from the previous verse, Krishna explains the threefold purpose of divine incarnation: protecting the devoted, destroying evil, and establishing righteousness."
    },
    {
      "chapter": 6,
      "verse": 5,
      "sanskrit": "उद्धरेदात्मनात्मानं नात्मानमवसादयेत्। आत्मैव ह्यात्मनो बन्धुरात्मैव रिपुरात्मनः॥",
      "transliteration": "uddhared ātmanātmānaṁ nātmānam avasādayet ātmaiva hy ātmano bandhur ātmaiva ripur ātmanaḥ",
      "wordByWord": "uddharet—one must deliver; ātmanā—by the mind; ātmānam—the self; na—not; ātmānam—the self; avasādayet—cause to fall down; ātmā—the mind; eva—certainly; hi—indeed; ātmanaḥ—of the self; bandhuḥ—friend; ātmā—the mind; eva—certainly; ripuḥ—enemy; ātmanaḥ—of the self",
      "translations": {
        "english": "One must elevate oneself by one's own mind, not degrade oneself. The mind is the friend of the conditioned soul, and the mind is also the enemy.",
        "hindi": "अपने द्वारा अपना उद्धार करे और अपने को अधोगति में न डाले। आत्मा ही आत्मा का बंधु है और आत्मा ही आत्मा का शत्रु है।",
        "telugu": "తన్ను తాను ఉద్ధరించుకొనవలెను. తన్ను తాను పతనము చేసికొనకూడదు. ఆత్మయే ఆత్మకు బంధువు, ఆత్మయే ఆత్మకు శత్రువు.",
        "tamil": "தன்னால் தன்னை உயர்த்திக்கொள்ள வேண்டும், தன்னைத் தாழ்த்திக்கொள்ளக்கூடாது. மனமே நண்பன், மனமே பகைவன்.",
        "kannada": "ತನ್ನನ್ನು ತಾನೇ ಉದ್ಧರಿಸಿಕೊಳ್ಳಬೇಕು, ತನ್ನನ್ನು ಕೆಳಗಿಳಿಸಿಕೊಳ್ಳಬಾರದು. ಆತ್ಮವೇ ಆತ್ಮನ ಮಿತ್ರ, ಆತ್ಮವೇ ಆತ್ಮನ ಶತ್ರು."
      },
      "explanation": "Krishna emphasizes self-responsibility for spiritual progress. The mind, when controlled and directed properly, elevates us; when uncontrolled, it becomes our worst enemy."
    },
    {
      "chapter": 9,
      "verse": 22,
      "sanskrit": "अनन्याश्चिन्तयन्तो मां ये जनाः पर्युपासते। तेषां नित्याभियुक्तानां योगक्षेमं वहाम्यहम्॥",
      "transliteration": "ananyāś cintayanto māṁ ye janāḥ paryupāsate teṣāṁ nityābhiyuktānāṁ yoga-kṣemaṁ vahāmy aham",
      "wordByWord": "ananyāḥ—having no other object; cintayantaḥ—concentrating; mām—on Me; ye—those who; janāḥ—persons; paryupāsate—properly worship; teṣām—of them; nitya—always; abhiyuktānām—fixed in devotion; yoga—requirements; kṣemam—protection; vahāmi—carry; aham—I",
      "translations": {
        "english": "To those who worship Me alone, thinking of no other, who are ever devoted, I carry what they lack and preserve what they have.",
        "hindi": "जो लोग अनन्य भाव से मुझ में चिन्तन करते हुए मेरी उपासना करते हैं, उन नित्य योगी भक्तों का योगक्षेम मैं स्वयं वहन करता हूँ।",
        "telugu": "అనన్య భావముతో నన్ను చింతించుచు ఉపాసించు వారికి నిత్యము యోగమునందు నిమగ్నులకు యోగక్షేమములను నేను వహించుచున్నాను.",
        "tamil": "என்னையே நினைத்து, வேறு எதுவும் இல்லாமல் வழிபடுபவர்களுக்கு, எப்போதும் என்னோடு இணைந்திருப்பவர்களுக்கு, இல்லாததை நான் கொடுக்கிறேன், இருப்பதைக் காக்கிறேன்.",
        "kannada": "ಅನನ್ಯ ಭಾವದಿಂದ ನನ್ನನ್ನು ಚಿಂತಿಸುತ್ತ ಉಪಾಸಿಸುವವರಿಗೆ, ನಿತ್ಯ ಯೋಗದಲ್ಲಿರುವವರಿಗೆ, ಯೋಗಕ್ಷೇಮವನ್ನು ನಾನು ವಹಿಸುತ್ತೇನೆ."
      },
      "explanation": "One of the most reassuring verses, promising divine providence to those who surrender completely. 'Yoga' means obtaining what is needed, 'kshema' means preserving what is obtained."
    },
    {
      "chapter": 11,
      "verse": 32,
      "sanskrit": "कालोऽस्मि लोकक्षयकृत्प्रवृद्धो लोकान्समाहर्तुमिह प्रवृत्तः॥",
      "transliteration": "kālo 'smi loka-kṣaya-kṛt pravṛddho lokān samāhartum iha pravṛttaḥ",
      "wordByWord": "kālaḥ—time; asmi—I am; loka—of the worlds; kṣaya-kṛt—the destroyer; pravṛddhaḥ—great; lokān—all people; samāhartum—in destroying; iha—in this world; pravṛttaḥ—engaged",
      "translations": {
        "english": "I am Time, the great destroyer of the worlds, and I have come here to destroy all people.",
        "hindi": "मैं लोकों का नाश करने वाला बढ़ा हुआ काल हूँ। इस समय इन लोकों को नष्ट करने के लिए प्रवृत्त हुआ हूँ।",
        "telugu": "లోకములను సంహరించు గొప్ప కాలమును నేను. ఈ లోకములను నశింపజేయుటకు ఇచట ప్రవర్తించుచున్నాను.",
        "tamil": "உலகங்களை அழிக்கும் பெரிய காலம் நான். இங்கு உலகங்களை அழிக்க வந்திருக்கிறேன்.",
        "kannada": "ಲೋಕಗಳನ್ನು ನಾಶಮಾಡುವ ದೊಡ್ಡ ಕಾಲನಾಗಿದ್ದೇನೆ ನಾನು. ಇಲ್ಲಿ ಲೋಕಗಳನ್ನು ಸಂಹರಿಸಲು ಪ್ರವೃತ್ತನಾಗಿದ್ದೇನೆ."
      },
      "explanation": "During the vision of the Universal Form, Krishna reveals his identity as Time itself—the ultimate force that consumes all. This verse is famously quoted by Oppenheimer after the first nuclear test."
    },
    {
      "chapter": 18,
      "verse": 66,
      "sanskrit": "सर्वधर्मान्परित्यज्य मामेकं शरणं व्रज। अहं त्वा सर्वपापेभ्यो मोक्षयिष्यामि मा शुचः॥",
      "transliteration": "sarva-dharmān parityajya mām ekaṁ śaraṇaṁ vraja ahaṁ tvā sarva-pāpebhyo mokṣayiṣyāmi mā śucaḥ",
      "wordByWord": "sarva-dharmān—all varieties of religion; parityajya—abandoning; mām—unto Me; ekam—only; śaraṇam—for surrender; vraja—go; aham—I; tvā—you; sarva—all; pāpebhyaḥ—from sins; mokṣayiṣyāmi—will deliver; mā—do not; śucaḥ—worry",
      "translations": {
        "english": "Abandon all varieties of religion and just surrender unto Me. I shall deliver you from all sinful reactions. Do not fear.",
        "hindi": "सम्पूर्ण धर्मों को त्यागकर तू केवल मेरी शरण में आ जा। मैं तुझे सम्पूर्ण पापों से मुक्त कर दूँगा, शोक मत कर।",
        "telugu": "సర్వధర్మములను పరిత్యజించి నన్నొక్కని శరణము వేడుము. నేను నిన్ను సర్వపాపములనుండి విముక్తి చేసెదను. దుఃఖింపకుము.",
        "tamil": "எல்லா தர்மங்களையும் விட்டு, என்னையே சரண் அடை. எல்லா பாவங்களிலிருந்தும் நான் உன்னை விடுவிப்பேன். கவலைப்படாதே.",
        "kannada": "ಸಕಲ ಧರ್ಮಗಳನ್ನು ತ್ಯಜಿಸಿ ನನ್ನೊಬ್ಬನನ್ನೇ ಶರಣು ಹೊಂದು. ನಾನು ನಿನ್ನನ್ನು ಎಲ್ಲ ಪಾಪಗಳಿಂದ ಬಿಡುಗಡೆ ಮಾಡುತ್ತೇನೆ. ದುಃಖಿಸಬೇಡ."
      },
      "explanation": "The final and ultimate teaching of the Gita—complete surrender to the divine. This 'charama shloka' (conclusive verse) summarizes the entire Gita: surrender all paths and simply take refuge in the Lord."
    }
  ]
}
